Table of Contents
 Interface IIdeaLoadCase
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaLoadCase : IIdeaLoading, IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Description
Additional info
string Description { get; }
Property Value
string
 LoadGroup
Load group
IIdeaLoadGroup LoadGroup { get; }
Property Value
IIdeaLoadGroup
 LoadType
Load case type
LoadCaseType LoadType { get; }
Property Value
LoadCaseType
 Type
Sub type
LoadCaseSubType Type { get; }
Property Value
LoadCaseSubType
 Variable
Variable type
VariableType Variable { get; }
Property Value
VariableType
 Edit this page